app/views/site/studentFilterSelection.html.haml

SELECT "filters".* FROM "filters" WHERE "filters"."query_id" = ?  [["query_id", 1]]
---
            - filterIndex = 0
            - @query.prefilters.each do |filter|

SELECT "headers".* FROM "headers" WHERE "headers"."query_id" = ?  [["query_id", 1]]
---
    -#        - i = 0
    -#        - @query.headers.each do |header|

INSERT INTO "filters" ("field", "comparator", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["field", "classification"], ["comparator", "="], ["value", "U4"], ["created_at", "2016-11-08 03:47:20.394251"], ["updated_at", "2016-11-08 03:47:20.394251"]]
---
        rowfilterDiv.appendChild(list);
        rowfilterDiv.appendChild (document.createTextNode (" "));