app/controllers/site_controller.rb

SELECT "students"."name" FROM "students"
---
  def receiveAjax
    #grabs all uniq values for the given column
    dataToSend = Student.select(params[:c_name].to_sym).map(&params[:c_name].to_sym).uniq.inspect

SELECT "spreadsheets".* FROM "spreadsheets"
---
  def index
    @spreadsheet = Spreadsheet.new
    @spreadsheets = Spreadsheet.all

SELECT "queries".* FROM "queries" WHERE (name = 'Test_Save')
SELECT COUNT(*) FROM "filters" WHERE "filters"."query_id" = ?  [["query_id", 1]]
SELECT COUNT(*) FROM "headers" WHERE "headers"."query_id" = ?  [["query_id", 1]]
---
  def studentFilterSelection

    #stores the selected year
    if(params["yearSelected"])
      session["yearSelected"] = params["yearSelected"]
      @year=params["yearSelected"]
    end

    #if year wasn't stored, it should be a new selected year, store it
    if (session["yearSelected"] != nil)
      @students = Student.where("year = \'" + session["yearSelected"] + "\'")
    end

    @queries = Query.all #gets all the stored queries

    #if a query was loaded
    if params["queryLoad"]
      @query = (Query.where("name = " + "\'" + params["queryLoad"] + "\'"))[0]
      @filterCount = @query.filters.count
      @headerCount = @query.headers.count

SELECT "filters".* FROM "filters" WHERE "filters"."query_id" = ?  [["query_id", 1]]
INSERT INTO "filters" ("field", "comparator", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["field", "classification"], ["comparator", "="], ["value", "U4"], ["created_at", "2016-11-08 03:47:20.394251"], ["updated_at", "2016-11-08 03:47:20.394251"]]
---
    #grab the existing filter values
    @filterValues = []
    if @query
      @query.filters.each do |filter|
        @filterValues << filter.value

SELECT COUNT(*) FROM "students" WHERE (prim_deg='PHD') AND (year='2014') AND (prim_deg_maj_1 = 'CPSL' OR prim_deg_maj_1 = 'CPSC') AND (prim_deg_cat='Summer 2014 - College Station' OR prim_deg_cat='Fall 2014 - College Station' OR prim_deg_cat='Spring 2015 - College Station') AND (country_of_origin!= ' ' AND country_of_origin!= 'United States')
---
   def formF_4
      year=params[:year]
      next_year=year.to_i+1
      next_year=next_year.to_s
      h1="Summer #{year} - College Station"
      h2="Fall #{year} - College Station"
      h3="Spring #{next_year} - College Station"
      @students=Student.all
      @students=@students.where("prim_deg='PHD'").where("year=?",year)
      c_attribute=[" ","CS","CE"]
      r_attribute=["Number of newly-admitted PHD students from outside the North America?"]
      c_filter=["prim_deg_maj_1 = 'CPSL' OR prim_deg_maj_1 = 'CPSC'","prim_deg_maj_1 = 'CECN' OR prim_deg_maj_1 = 'CECL'"]
      r_filter="country_of_origin!= ' ' AND country_of_origin!= 'United States'"
      array=[]
      array<<c_attribute
      temp=[]
      temp<<r_attribute[0]
      temp<<@students.where(c_filter[0]).where("prim_deg_cat=? OR prim_deg_cat=? OR prim_deg_cat=?",h1,h2,h3).where(r_filter).count.to_s

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CPSL' OR prim_deg_maj_1='CPSC') AND (prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
  def formI_1
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CPSL' OR prim_deg_maj_1='CPSC'").where("prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CECN' OR prim_deg_maj_1='CECL') AND (prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
  def formI_2
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CECN' OR prim_deg_maj_1='CECL'").where("prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT COUNT(*) FROM "students" WHERE (prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN') AND (year=) AND (prim_deg_maj_1 = 'CPSL' OR prim_deg_maj_1 = 'CPSC') AND (prim_deg_cat='Summer  - College Station' OR prim_deg_cat='Fall  - College Station' OR prim_deg_cat='Spring 1 - College Station') AND (country_of_origin!= ' ' AND country_of_origin!= 'United States')
---
  def formJ_2
      year=params[:year]
      next_year=year.to_i+1
      next_year=next_year.to_s
      h1="Summer #{year} - College Station"
      h2="Fall #{year} - College Station"
      h3="Spring #{next_year} - College Station"
      @students=Student.all
      @students=@students.where("prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN'").where("year=?",year)
      c_attribute=[" ","CS","CE"]
      r_attribute=["Number of newly-admitted master students from outside the North America?"]
      c_filter=["prim_deg_maj_1 = 'CPSL' OR prim_deg_maj_1 = 'CPSC'","prim_deg_maj_1 = 'CECN' OR prim_deg_maj_1 = 'CECL'"]
      r_filter="country_of_origin!= ' ' AND country_of_origin!= 'United States'"
      array=[]
      array<<c_attribute
      temp=[]
      temp<<r_attribute[0]
      temp<<@students.where(c_filter[0]).where("prim_deg_cat=? OR prim_deg_cat=? OR prim_deg_cat=?",h1,h2,h3).where(r_filter).count.to_s

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL') AND (prim_deg='BS') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
  def formM_1
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL'").where("prim_deg='BS'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN') AND (prim_deg='BS') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
   def formM_2
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN'").where("prim_deg='BS'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL') AND (prim_deg='PHD') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
def formE_1
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL'").where("prim_deg='PHD'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN') AND (prim_deg='PHD') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')
---
  def formE_2
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN'").where("prim_deg='PHD'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count

SELECT "students".* FROM "students" WHERE (year='2014') AND (prim_deg_maj_1='CECN')
---
  def studentManual
  #  raise params.inspect
    @year=params[:cur_year]
    if params["commit"] == "Save"
      saveQuery(params)
    else
      #if the query is not being saved
      #select all the filters and filter values chosen
     # raise params.inspect
      prefilters = params.select { |key, value| key.to_s.match(/^filter\d+/) }
      prefilters_value= params.select { |key, value| key.to_s.match(/^filterValue\d+/) }
      pre_comparator=params.select{|key,value| key.to_s.match(/^comparator\d+/)}
      collumfilters = params.select {|key, value| key.to_s.match(/^collumfilter\d+/)}
      collumfilters_value= params.select {|key, value| key.to_s.match(/^collumfilterValue\d+/)}
      collum_comparator= params.select {|key,value| key.to_s.match(/^collumcomparator\d+/)}
      rowfilters = params.select {|key, value| key.to_s.match(/^rowfilter\d+/)}
      rowfilters_value = params.select {|key, value| key.to_s.match(/^rowfilterValue\d+/)}
      row_comparators = params.select { |key, value| key.to_s.match(/rowcomparator\d+/) }
      filterValues = params.select { |key, value| key.to_s.match(/filterValue\d+/) }
      @attributes = params.select { |key, value| key.to_s.match(/attribute\d+/) }
     # raise prefilters["filter0"].inspect

      @student=Student.all