app/controllers/site_controller.rb

  def fromI_1
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CPSL' OR prim_deg_maj_1='CPSC'").where("prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count.to_s
---
SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CPSL' OR prim_deg_maj_1='CPSC') AND (prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')

  def fromI_2
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CECN' OR prim_deg_maj_1='CECL'").where("prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count.to_s
---
SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CECN' OR prim_deg_maj_1='CECL') AND (prim_deg='MS' OR prim_deg='MCS' OR prim_deg='MEN') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')

  def fromM_1
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL'").where("prim_deg='BS'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count.to_s
---
SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CPSC' OR prim_deg_maj_1='CPSL') AND (prim_deg='BS') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')

   def fromM_2
      year=params[:year]
      @students=Student.all
      #raise @students.inspect
      @students=@students.where("prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN'").where("prim_deg='BS'").where("year=?",year)
      c_attribute=[" ","Male","Female","Not Avaliable","Total"]
      r_attribute=["Residents (a.-h.)","a. American Indian or Alaska Native, not Hispanic", "b. Asain, not Hispanic","c. Black or African-American, not Hispanic","d. Native Hawallian or Other Pacific Islander, not Hispanic","e. White, not Hispanic"]
      r_attribute=r_attribute+["f. More than one race, not Hispanic","g. Hispanic or Latino, any race", "h. Race/Ethnicity Unknown","i. Nonresident Alien","j. Not available","k. Total"]
      c_filter=["sex='M'","sex='F'","sex=' '","sex='M' OR sex='F' OR sex=' '"]
      r_filter=["residency='R' AND ethnicity='I'","residency='R' AND ethnicity='T'","residency='R' AND ethnicity='B'","residency='R' AND ethnicity='N'"]
      r_filter=r_filter+["residency='R' AND ethnicity='W'","residency='R' AND ethnicity='M'","residency='R' AND ethnicity='H'","residency='R' AND ethnicity='O'"]
      r_filter=r_filter+["residency!='R' AND residency!='U'","residency='U'"]
      array=[]
      array<<c_attribute
      temp=[r_attribute[0]," "," "," "," "]
      array<<temp
      i=1
      r_filter.each do |r|
        temp=[]
        temp<<r_attribute[i]
        i=i+1
        c_filter.each do |c|
        temp<< @students.where(c).where(r).count.to_s
---
SELECT COUNT(*) FROM "students" WHERE (prim_deg_maj_1='CECL' OR prim_deg_maj_1='CECN') AND (prim_deg='BS') AND (year='') AND (sex='M' OR sex='F' OR sex=' ') AND (residency!='R' AND residency!='U')

     # raise queryString.inspect
     # raise @attributes.values.inspect

      @students = Student.where(queryString)
---
SELECT "students".* FROM "students" WHERE (prim_deg_maj_1='CECN' AND year = '1995')