app/controllers/spreadsheets_controller.rb

  def create
    Rails.logger.debug params.inspect
    #raise params.inspect
    @@val = false #set false for file not finished parsing
    params_to_pass = spreadsheet_params
    params_to_pass["name"] = params["year"]

    @spreadsheet = Spreadsheet.new(params_to_pass)
    f=params["spreadsheet"]["attachment"].original_filename
    @message=valid_extension?(f)
    if @message==false

    end
    #do the database population in separate thread
    #Thread.new do

      saved = @spreadsheet.saveAndMove
---
INSERT INTO "spreadsheets" ("attachment", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "wrong_input_file.non_csv_type"], ["name", "1995"], ["created_at", "2016-11-08 03:46:59.568435"], ["updated_at", "2016-11-08 03:46:59.568435"]]